
import math

"1. Проверка числа на чётность"

# a = int(input('введите число '))

# print('Определить, чётное ли введённое число.')
# if a%2 == 0:
#     print('четное',"\n")
# else:
#     print('нечетное',"\n")

# print("Определить, делится ли число на 5 без остатка.")
# if a%5 == 0:
#     print('да',"\n")
# else:
#     print('нет',"\n")

# print("Определить, делится ли число на 7 без остатка.")
# if a%7 == 0:
#     print('да',"\n")
# else:
#     print('нет',"\n")

# print("Определить, оканчивается ли число на цифру 3.")
# print(str(a)[-1])
# if str(a)[-1] == '3':
#     print('да',"\n")
# else:
#     print('нет',"\n")


"2. Сравнение двух чисел"

# a = int(input('введите число '))
# b = int(input('введите число '))

# print("Ввести два числа и вывести большее.")
# print(max(a,b),"\n")

# print("Ввести два числа и вывести меньшее.")
# print(min(a,b),"\n")

# print("Ввести два числа и вывести разницу между ними.")
# print(a-b,"\n")

# print("Ввести два числа и вывести «равны» или «не равны».")
# if a==b:
#     print("равны","\n")
# else:
#     print("неравны","\n")

"3. Таблица умножения числа"

# print("Вывести таблицу умножения на 2.")
# for i in range(1, 11):
#     print(f"2*{i}={2*i}","\n")

# print("Вывести таблицу умножения на 5.")
# for i in range(1, 11):
#     print(f"5*{i}={5*i}","\n")

# print("Вывести таблицу умножения на число, введённое пользователем.")
# a = int(input('введите число '))
# for i in range(1, 11):
#     print(f"{a}*{i}={a*i}","\n")

# print("Вывести таблицу умножения на 10.")
# for i in range(1, 11):
#     print(f"10*{i}={10*i}","\n")

"4. Сумма чисел в диапазоне"
# print("Найти сумму чисел от 1 до 10.")
# z = 0
# for i in range(1, 11):
#     z=i+z
# print(f"Сумма чисел от 1 до 10 -", z,"\n")

# print("Найти сумму чисел от 1 до N (N вводится).")
# z = 0
# n = int(input('введите число '))
# for i in range(1, n+1):
#     z=i+z
# print(f"Сумма чисел от 1 до {n} -", z,"\n")

# print("Найти сумму чётных чисел от 1 до N.")
# z = 0
# l = []
# for i in range (1, n+1):
#     if i%2 == 0:
#         l.append(i)
# print(f"Сумма четных чисел от 1 до {n} -", sum(l),"\n")

# print("Найти сумму нечётных чисел от 1 до N.")
# z = 0
# l = []
# for i in range (1, n+1):
#     if i%2 == 1:
#         l.append(i)
# print(f"Сумма четных чисел от 1 до {n} -", sum(l),"\n")

"5. Возведение в степень"
# a = int(input('введите число '))

# print('Возведение в квадрат -', a**2,"\n")

# print('Возведение в куб -', a**3,"\n")

# n = int(input('введите число '))
# print(f'Возведение числа {a} в степень {n} -', a**n,"\n")

# print(f'Вычислить 2 в степени {n} -', 2**n,"\n")

"6. Проверка возраста"

# a = int(input('введите возраст '))
# if a >=18:
#     print('Человек совершеннолетний',"\n")
# else:
#     print('Человек несовершеннолетний',"\n")

# if a >=65:
#     print('Возраст пенсионный',"\n")
# else:
#     print('Возраст непенсионный',"\n")

# if a>=7 and a<=18:
#     print('Возраст подходит для школы',"\n")
# else:
#     print('Возраст не подходит для школы',"\n")

# if a%10 == 0:
#     print('Возраст является круглым десятком',"\n")
# else:
#     print('Возраст не является круглым десятком',"\n")

"7. Факториал числа"

# b=3
# c=5
# fact = 1
# for i in range(1, b + 1):
#     fact *= i
# print(f'Факториал {b} это - {fact}',"\n")

# print(f'Факториал {c} это - {math.factorial(c)}',"\n")

# n = int(input('введите число '))
# print(f'Факториал {n} это - {math.factorial(n)}',"\n")

# a = int(input('введите число для факториала, выход из цикла - 0 '))
# while a !=0:
#     print(f'Факториал {a} это - {math.factorial(c)}',"\n")
#     a = int(input('введите число '))

"8. Работа с цифрами числа"

# a = input('введите двузначное число ')
# if len(a) == 2:
#     print("Сумма цифр числа",int(a[:1]) + int(a[1:]),"\n")

# if len(a) == 2:
#     print("Произведение цифр числа",int(a[:1]) * int(a[1:]),"\n")

# a = input('введите трехзначное число ')
# if len(a) == 3:
#     print("Сумма цифр числа",int(a[:1]) + int(a[1:2]) + int(a[-1:]) ,"\n")

# if len(a) == 3:
#     print("Первая и последняя цифра",int(a[:1]), int(a[-1:]),"\n")

"9. Проверка символа"

# a = input('введите символ ')

# if a.isdigit()==True:
#     print('Является цифрой',"\n")
# else:
#     print('не является цифрой',"\n")

# if a.isalpha()==True:
#     print('Является буквой',"\n")
# else:
#     print('Не является буковй',"\n")


# vowels = {"а", "е", "ё", "и", "о", "у", "ы", "э", "ю", "я"}

# if a.lower in vowels:
#     print('Гласная буква',"\n")
# else:
#     print('Согласная буква',"\n")

# if a.islower():
#     print('Прописная буква',"\n")

"10. Циклы с условием"

# print("Вводить числа, пока не введут 0, и посчитать их сумму.","\n")

# total = 0
# while True:
#     num = int(input("Введите число (0 для выхода): "))
#     if num == 0:
#         break
#     total += num

# print(f"Сумма введенных чисел: {total}","\n")

# print("Вводить числа, пока не введут отрицательное, и посчитать количество введённых.","\n")

# count = 0
# while True:
#     num = float(input("Введите число: "))
#     if num < 0:
#         break
#     count += 1

# print(f"Количество введенных чисел: {count}","\n")

# print("Вводить числа, пока не введут чётное, и вывести сумму нечётных.","\n")

# total = 0
# while True:
#     num = int(input("Введите число: "))
#     if num % 2 == 0:
#         break
#     total += num

# print(f"Сумма нечетных чисел: {total}","\n")

# print("Вводить числа, пока не введут число больше 100, и вывести среднее арифметическое.","\n")
# total = 0
# count = 0

# while True:
#     num = float(input("Введите число: "))
#     if num > 100:
#         break
#     total += num
#     count += 1

# if count > 0:
#     average = total / count
#     print(f"Среднее арифметическое: {average:.2f}","\n")
# else:
#     print("Не было введено чисел до 100","\n")

